import pandas as pd
# EX.학생 성적 데이터 생성
data = {
    '이름' : ['철수','영희','민수','지영','수현','지훈'],
    '학년' : [ 1, 1, 2, 2, 3, 3],
    '국어' : [80, 95, 70, 88, 90, 85],
    '영어' : [85, 90, 75, 95, 92, 80],
    '수학' : [78, 85, 68, 90, 95, 82]
}

df = pd.DataFrame(data)
# print(df)

#print(df[df['영어'] > df['국어']])
#print(df[(df['학년'] >= 2) & (df['영어'] >= 90)])
#print(df[(df['국어'] < 80) | (df['수학'] < 80 )])
#print(df[df['이름'].str.contains('지')])

#ex. 상품 매출 데이터 생성
data2 = {
    '지점' : ['서울','서울','부산','부산','대구','대구'],
    '제품' : ['TV', '냉장고', 'TV', '세탁기','TV','냉장고'],
    '매출' : [500, 800, 600, 400, 550, 750],
    '수량' : [5, 8, 6, 4, 5, 7],
    '월' : [1, 1, 2, 2, 3, 3]
}

df1 = pd.DataFrame(data2)


# print(df1[df1['매출'] >= 600])
# print(df1[df1['월'] == 2])
# print(df1[df1['지점'] != '부산'])
# print(df1[df1['매출'] > df1['매출'].mean()])
# print(df1['매출'].mean())
# print(df1[(df1['매출'] >= 600) & (df1['수량'] >= 6)])

data3 = {
    '국어' : [95, 72, 83, 89, 100],
    '수학' : [88, 72, 93, 80, 95],
    '영어' : [96, 68, 85, 94, 93]
}

df3 = pd.DataFrame(data3, index = ['민수', '도윤', '서아','연우','하준'])
print(df3)
'''
print(df3.loc['민수']) # (시리즈) index가 민수인 행 추출
print(df3.loc[['민수', '서아']]) # (데이터 프레임) index가 민수와 서아인 행 추출
print(df3.loc['도윤':'연우']) # (데이터 프레임) index가 도윤 ~ 연우 까지 행 추출
'''
'''print(df3.loc['도윤','국어']) # (단일값) index가 도윤이고, 컬럼이 국어인 원소 추출
print(df3.loc[['민수','도윤'] , ['국어','영어']]) # (데이터 프레임) index가 민수, 도윤이고 컬럼이 국어, 영어인 데이터 추출
print(df3.loc[:'서아', '수학':'영어']) # (데이터 프레임) index가 처음 ~ 서아까지, 컬럼은 수학 ~ 영어까지의 데이터 추출

print(df3.loc[df3['영어'] >= 90, ['국어','영어']])'''

print(df3)
print('='*30)
print(df3.iloc[-1])